tutorials/testcases/flowOverCylinder/movingCylinder/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  2.1.x                                 |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0.353553390593 0.353553390593 0.0) // 0
    (-0.353553390593 0.353553390593 0.0) // 1
    (-0.353553390593 -0.353553390593 0.0) // 2
    (0.353553390593 -0.353553390593 0.0) // 3
    (0.707106781187 0.707106781187 0.0) // 4
    (-0.707106781187 0.707106781187 0.0) // 5
    (-0.707106781187 -0.707106781187 0.0) // 6
    (0.707106781187 -0.707106781187 0.0) // 7
    (-3.0 -3.0 0.0) // 8
    (6.0 -3.0 0.0) // 9
    (6.0 3.0 0.0) //10
    (-3.0 3.0 0.0) //11

    (0.353553390593 0.353553390593 0.01) //12
    (-0.353553390593 0.353553390593 0.01) //13
    (-0.353553390593 -0.353553390593 0.01) //14
    (0.353553390593 -0.353553390593 0.01) //15
    (0.707106781187 0.707106781187 0.01) //16
    (-0.707106781187 0.707106781187 0.01) //17
    (-0.707106781187 -0.707106781187 0.01) //18
    (0.707106781187 -0.707106781187 0.01) //19
    (-3.0 -3.0 0.01) //20
    (6.0 -3.0 0.01) //21
    (6.0 3.0 0.01) //22
    (-3.0 3.0 0.01) //23
);

blocks
(
    hex ( 0  4  5  1 12 16 17 13) inner (34 75 1) simpleGrading (2.0 1 1)
    hex ( 1  5  6  2 13 17 18 14) inner (34 75 1) simpleGrading (2.0 1 1)
    hex ( 2  6  7  3 14 18 19 15) inner (34 75 1) simpleGrading (2.0 1 1)
    hex ( 3  7  4  0 15 19 16 12) inner (34 75 1) simpleGrading (2.0 1 1)

    hex ( 8  9 10 11 20 21 22 23) outer (107 71 1) simpleGrading (1 1 1)
);

edges
(
    arc  0  1 (0 0.5 0)
    arc  1  2 (-0.5 0 0)
    arc  2  3 (0 -0.5 0)
    arc  3  0 (0.5 0 0)

    arc  4  5 (0 1.0 0)
    arc  5  6 (-1.0 0 0)
    arc  6  7 (0 -1.0 0)
    arc  7  4 (1.0 0 0)

    arc 12 13 (0 0.5 0.01)
    arc 13 14 (-0.5 0 0.01)
    arc 14 15 (0 -0.5 0.01)
    arc 15 12 (0.5 0 0.01)

    arc 16 17 (0 1.0 0.01)
    arc 17 18 (-1.0 0 0.01)
    arc 18 19 (0 -1.0 0.01)
    arc 19 16 (1.0 0 0.01)
);

boundary
(
    cylinder
    {
        type wall;
        faces
        (
            ( 0 12 13  1)
            ( 1 13 14  2)
            ( 2 14 15  3)
            ( 3 15 12  0)
        );
    }

    inner
    {
        type bellerophon;
        donorZone outer;
        oversetZones (inner);
        faces
        (
            ( 4  5 17 16)
            ( 5  6 18 17)
            ( 6  7 19 18)
            ( 7  4 16 19)
        );
    }

    inlet
    {
        type patch;
        faces
        (
            ( 8 20 23 11)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            ( 9 10 22 21)
        );
    }

    sides
    {
        type patch;
        faces
        (
            (10 11 23 22)
            ( 8  9 21 20)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            ( 0  1  5  4)
            ( 1  2  6  5)
            ( 2  3  7  6)
            ( 3  0  4  7)

            (16 17 13 12)
            (17 18 14 13)
            (18 19 15 14)
            (19 16 12 15)

            ( 8  9 10 11)
            (23 22 21 20)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
