tutorials/testcases/flowOverCylinder/movingCylinder/0.org/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1e-4;

boundaryField
{
    cylinder
    {
        type            nutUSpaldingWallFunction;
        value           $internalField;
    }

    inner
    {
        type            bellerophon;
        value           $internalField;
    }

    inlet
    {
        type            calculated;
    }

    outlet
    {
        type            calculated;
    }

    sides
    {
        type            calculated;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
