tutorials/testcases/flowOverCylinder/movingCylinder/system/refineMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      refineMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

set refineCells_0;

coordinateSystem global;

globalCoeffs
{
    tan1 (1 0 0);
    tan2 (0 1 0);
}

directions
(
    tan1
    tan2
);

useHexTopology  true;

geometricCut    false;

writeMesh       false;

// ************************************************************************* //

