tutorials/testcases/flowOverCylinder/movingCylinder/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    refineCells_0;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box     (-1.16755160819 -2.16755160819 -1.16755160819) (1.16755160819 2.16755160819 1.16755160819);
        }
    }
    {
        name    refineCells_0;
        type    cellSet;
        action  delete;        source  zoneToCell;
        sourceInfo
        {
            name inner;
        }
    }
    {
        name    refineCells_1;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box     (-1.50265482457 -2.50265482457 -1.50265482457) (1.50265482457 2.50265482457 1.50265482457);
        }
    }
    {
        name    refineCells_1;
        type    cellSet;
        action  delete;        source  zoneToCell;
        sourceInfo
        {
            name inner;
        }
    }
);

// ************************************************************************* //

