tutorials/testcases/flowOverCylinder/movingCylinder/system/yWall
    yWall
    {
        type writeRegisteredObject;
        functionObjectLibs   ( "libIOFunctionObjects.so" );
        objectNames          ( yWall );
        outputControl        outputTime;
        outputInterval       1;
    }
